package web

// 定义函数类型？
type Middleware func(next HandleFunc) HandleFunc

// 它既是一个责任链模式，也是一个洋葱模式，后面你们可以看到我在中间价设计里会大量使用这个模式

//• 什么是洋葱模式？形如洋葱，拥有一个核心，这个核心一般就是业务逻辑。而后在这个核心外面层层包裹，每一层就是一个Middleware。
//  一般用洋葱模式来无侵入式地增强核心功能，或者解决 AOP问题。
// 无侵入式其实也接近装饰器模式，装饰器也是一层一层封装
// 代理模式呢？
//• 什么是责任链模式？不同的 Handler 组成一条链，链条上的每一环都有自己功能。
//  一方面可以用责任链模式將复杂逻辑分成链条上的不同步骤，另外一方面也可以灵活地在链条上添加新的 Handler。
// 不过一般在责任链里面我们不叫handler，我们叫filter
// 这里面讲究的地方就是filter要不要自由的决定说我要不要调下一个filter，还是说我有一个中控式的调度中心来去调用你的filter，就这两种区别
//• 怎么实现？ 最简单的方案就是我们课程上讲的这种函数式方案，还有一种是集中调度的模式。

// 它不是return next, 而是主动调用next，所以说是可以在next调用链运行完之后在做些什么处理的是不是
